Repository: lucka-me/intel-stack
Catalog: App/Shared/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# AddPluginView.Add
source: Add
zh_hans: 加入

# AddPluginView.Cancel
source: Cancel
zh_hans: 取消

# AddPluginView.CodeSection.Filename
source: Filename
zh_hans: 文件名

# AddPluginView.Download
source: Download
zh_hans: 下载

# AddPluginView.Method
source: Method
zh_hans: 方式

# AddPluginView.Method.Code
source: Code
zh_hans: 代码

# AddPluginView.Method.Remote
source: Remote
zh_hans: 远程

# AddPluginView.PluginInformation.Author
source: Author
zh_hans: 作者

# AddPluginView.PluginInformation.Category
source: Category
zh_hans: 分类

# AddPluginView.PluginInformation.Footer
source: The plugin will be saved as an external plugin.
zh_hans: 这个插件会被保存为外部插件。

# AddPluginView.PluginInformation.Name
source: Name
zh_hans: 名称

# AddPluginView.PluginInformation.Title
source: Plugin Information
zh_hans: 插件信息

# AddPluginView.PluginInformation.Version
source: Version
zh_hans: 版本

# AddPluginView.TaskError.ExternalLocationUnavailable
source: The location to save external plugins is unavailable
zh_hans: 存储外部插件的位置不可用

# AddPluginView.TaskError.ExternalLocationUnavailable.Reason
source: Please ensure the location is selected in Settings and existing
zh_hans: 请确保在设置页面设置了位置，并且这个位置存在

# AddPluginView.TaskError.InvalidURL
source: The URL is invalid
zh_hans: 不是合法的链接

# AddPluginView.TaskError.InvalidURL.Reason
source: Please check the format of URL, and it should end up with .user.js
zh_hans: 请检查链接的格式，此外它应当以.user.js结尾

# AddPluginView.Title
source: Add External Plugin
zh_hans: 添加外部插件

# AddPluginView.URL
source: URL
zh_hans: 链接

# ContentView.EmptyHint
source: Select from sidebar
zh_hans: 从边栏中选择

# HTTPResponseError.InvalidHTTPResponse %lld
source: Invalid HTTP response code: %lld
zh_hans: 无效的HTTP回应状态码：%lld

# HTTPResponseError.InvalidResponseType
source: Invalid response type
zh_hans: 无效的回应类型

# HTTPResponseError.InvalidResponseType.Reason
source: The response is not a HTTPURLResponse object
zh_hans: 回应不是一个HTTPURLResponse类型的对象

# OnboardingView.Action.Continue
source: Continue
zh_hans: 继续

# OnboardingView.Action.Download
source: Download
zh_hans: 下载

# OnboardingView.Download
source: Download Scripts
zh_hans: 下载脚本

# OnboardingView.Download.Content
source: Intel Stack need to download the main IITC script and internal plugins. 65 plugins will be downloaded, around 2.5 MB in total.
zh_hans: Intel Stack需要下载IITC主脚本和内部插件。将会下载65个内部插件，总共约2.5MB。

# OnboardingView.Download.Content.Done
source: The main IITC script and internal plugins are downloaded.
zh_hans: IITC主脚本和内部插件下载完成。

# OnboardingView.Title
source: Welcome to Intel Stack
zh_hans: 欢迎使用Intel Stack

# PluginListView.Disabled
source: Disabled
zh_hans: 未启用

# PluginListView.Enabled
source: Enabled
zh_hans: 已启用

# PluginListView.External
source: External
zh_hans: 外部

# PluginListView.Internal
source: Internal
zh_hans: 内部

# PluginListView.NoDescriptions
source: (No descriptions)
zh_hans: （没有描述）

# SettingsView.About.IITCWebsite
source: IITC-CE Website
zh_hans: IITC-CE 网站

# SettingsView.About.SourceCode
source: Source Code
zh_hans: 源代码

# SettingsView.About.Title
source: About
zh_hans: 关于

# SettingsView.BuildChannel.Channel
source: Channel
zh_hans: 通道

# SettingsView.BuildChannel.Footer
source: In the next update, Intel Stack will download IITC main script and internal plugins from the selected channel.
zh_hans: 下次更新时，Intel Stack会从选取的通道下载IITC主脚本和内部插件

# SettingsView.BuildChannel.Title
source: Build Channel
zh_hans: 构建通道

# SettingsView.ExternalScripts.ChangeLocation
source: Change Location
zh_hans: 更换位置

# SettingsView.ExternalScripts.Footer
source: Intel Stack will load user scripts from the location.
zh_hans: Intel Stack会从选择的位置中加载用户脚本。

# SettingsView.ExternalScripts.SelectLocation
source: Select Location
zh_hans: 选择位置

# SettingsView.ExternalScripts.Title
source: External Scripts
zh_hans: 外部脚本

# SettingsView.Title
source: Settings
zh_hans: 设置

# SidebarView.Extension
source: Safari Extension
zh_hans: Safari浏览器扩展

# SidebarView.Extension.Disabled
source: Disabled
zh_hans: 已停用

# SidebarView.Extension.Enabled
source: Enabled
zh_hans: 已启用

# SidebarView.Extension.Unknown
source: Unknown
zh_hans: 未知

# SidebarView.Plugins
source: Plugins
zh_hans: 插件

# SidebarView.Plugins.Add
source: Add
zh_hans: 添加

# SidebarView.Plugins.Footer %lld
source: %lld plugins in total.
zh_hans: 共%lld个插件。

# SidebarView.Script
source: IITC Script
zh_hans: IITC脚本

# SidebarView.Script.Enabled
source: Enabled
zh_hans: 启用

# SidebarView.Script.Footer
source: Pull to update scripts.
zh_hans: 下拉以更新脚本。

# SidebarView.Script.Unavailable
source: Unavailable
zh_hans: 不可用

# SidebarView.Script.Updating
source: Updating
zh_hans: 正在更新

# SidebarView.Settings
source: Settings
zh_hans: 设置

# SidebarView.Update
source: Update
zh_hans: 更新

# UserScriptMetadataDecoder.SyntaxError
source: The syntax of metadata block is incorrect.
zh_hans: 元数据块存在语法错误

# UserScriptMetadataDecoder.SyntaxError.Closing.Reason
source: The closing line is missing.
zh_hans: 结束行不存在

# UserScriptMetadataDecoder.SyntaxError.Configuration.Reason %@
source: The configuration format is incorrect: %@
zh_hans: 配置格式错误：%$@

# UserScriptMetadataDecoder.SyntaxError.Opening.Reason
source: The opening line is missing
zh_hans: 开始行不存在
